# config.py

# --- WiFi & OTA ---
WIFI_CONFIGS = [
  ('WK_AIS_2.4G', '0813996766'),
  ('Galaxy A7189EE', '12345678')
]
ENABLE_OTA = False  # ตั้งเป็น False ถ้าต้องการข้ามการเช็คอัปเดต (By Pass)
OTA_USER = "wasankds"
OTA_REPO = "pico-ota"
OTA_DIR  = "pico-ac-remote-lg"
OTA_FILES = ["main.py", "wifi_manager.py", "config.py"]

# --- MQTT Settings ---
MQTT_BROKER = '192.168.1.100'
DEVICE_ID   = "pico-003"
CLIENT_ID   = 'pico-003'
# --- การจัดการ Topic ทั้งหมด ---
TOPIC_AC_ON = DEVICE_ID + "/ac/on"
TOPIC_AC_OFF = DEVICE_ID + "/ac/off"
TOPIC_AC_LED = DEVICE_ID + "/ac/led"
TOPIC_SENSOR_DHT = DEVICE_ID + "/sensor/dht"
TOPIC_QUERY     = DEVICE_ID + "/system/query"
TOPIC_AVAIL     = DEVICE_ID + "/system/availability"
TOPIC_UPDATE    = DEVICE_ID + "/system/update"

# --- ข้อมูลดิบ (Raw Data) เปิดแอร์ ---
RAW_ON = [563, 1528, 549, 491, 550, 485, 550, 494, 549, 1528, 549, 485, 550, 497, 550, 491, 537, 498, 549, 485, 548, 486, 549, 497, 550, 485, 549, 485, 550, 486, 549, 499, 550, 1527, 549, 498, 548, 499, 550, 486, 549, 485, 549, 498, 536, 499, 550, 485, 549, 1541, 536, 500, 549, 499, 548, 511, 549]

RAW_OFF = [589, 1516, 562, 490, 550, 498, 549, 480, 551, 1528, 548, 486, 561, 485, 549, 480, 561, 1515, 561, 1528, 561, 487, 562, 473, 562, 486, 548, 499, 549, 485, 549, 486, 549, 486, 562, 486, 549, 485, 548, 486, 549, 485, 563, 1529, 561, 487, 562, 1528, 562, 485, 550, 487, 548, 486, 549, 1529, 561]

RAW_LIGHT = [600, 1490, 576, 476, 562, 485, 562, 481, 549, 1528, 549, 485, 549, 486, 561, 480, 550, 1528, 549, 1540, 549, 473, 573, 473, 575, 486, 548, 485, 562, 485, 548, 485, 574, 473, 561, 484, 549, 486, 549, 485, 563, 1514, 561, 485, 548, 1528, 549, 472, 574, 485, 548, 1527, 563, 1527, 549, 485, 563]